===
simple variable
===

var myVariable = "some shiz";

---

(source_file
    (variable_declaration
        (simple_identifier)
        (string_literal)))

===
variable with type declaration
===

var myVariable as Number = 2;

---

(source_file
 (variable_declaration
  (typed_identifier
   (simple_identifier)
   (identifier))
   (number_literal)))

===
variable with visibility
===

private var myVariable as String = "shiz";

---

(source_file
 (variable_declaration
  (visibility_modifier)
  (typed_identifier
   (simple_identifier)
   (identifier))
  (string_literal)))

===
constant
===

private const MY_CONST as Number = 69420;

---
(source_file
 (variable_declaration
  (visibility_modifier)
  (typed_identifier
   (simple_identifier)
   (identifier))
  (number_literal)))
